glcloud/keil_v5/ARM/PACK/.Web/Maxim.MAX32650.pdsc
<?xml version="1.0" encoding="utf-8"?>
<package schemaVersion="1.3" xmlns:xs="http://www.w3.org/2001/XMLSchema-instance" xs:noNamespaceSchemaLocation="PACK.xsd">
   <vendor>Maxim</vendor>
   <name>MAX32650</name>
   <url>http://www.mxim.net/microcontroller/pack/</url>
   <description>Maxim Integrated MAX32650 and MAX32651 Series Device Support, Board Support Package and Examples</description>
   <supportContact>support@maximintegrated.com</supportContact>

   <license>License/END_USER_LICENSE_AGREEMENT.rtf</license>

   <releases>
      <release version="1.1.0-a" date="2018-07-11">
         - Updates to ARM startup
      </release>
      <release version="1.0.6" date="2018-07-11">
         - Additional demo support
         - Updates to API for portability
         - Moved peripherals to predefined group in CMSIS.
      </release>
      <release version="1.0.5" date="2018-05-16">
         - Added mem_utils to the startup group.
      </release>
      <release version="1.0.4" date="2018-05-15">
         - Updated MAXUSB device library for the High-Speed USB supported on the MAX3265x family.
         - Added USB examples.
      </release>
      <release version="1.0.3" date="2018-05-08">
         - Updated MAXUSB device library for the High-Speed USB supported on the MAX3265x family.
         - Added USB examples.
      </release>
      <release version="1.0.2" date="2018-04-17">
         - Added device support for MAX32651 and MAX32652
      </release>
      <release version="1.0.1" date="2018-04-15">
         - Corrected Keil MDK projects.
         - Added __backspace support required for scanf.
         - Reduced warnings in both IAR and Keil for the SDK.
      </release>
      <release version="1.0.0" date="2018-04-13">
         - Added MAXUSB Component Libraries.
         - Added SDHC Component Libraries.
         - Fixed BSP dependencies to require I2C, SPI and UART.
         - Fixed stdio issue to avoid a compiler issue.
      </release>
   </releases>

   <keywords>
      <keyword>Maxim</keyword>
      <keyword>MAX32651</keyword>
      <keyword>MAX32650</keyword>
      <keyword>MAX32650 Evaluation Kit</keyword>
      <keyword>Maxim Device Support</keyword>
      <keyword>Device Support</keyword>
      <keyword>Device Family Package Maxim</keyword>
      <keyword>Maxim Evaluation Kit</keyword>
   </keywords>

   <requirements>
      <packages>
         <package name="CMSIS" vendor="ARM"/>
      </packages>
      <languages>
         <language name="C" version="99" />
      </languages>
   </requirements>

   <devices>
      <family Dfamily="MAX3265X" Dvendor="Maxim:23">
         <processor Dcore="Cortex-M4" DcoreVersion="r0p1" Dfpu="FPU" Dmpu="NO_MPU" Dendian="Little-endian" Dclock="120000000" />
         <compile header="Libraries/Device/Maxim/MAX32650/Include/max32650.h" />
         <debug svd="SVD/MAX32650/max32650.svd" />
         <description>
           The MAX3265x device family is designed for wearable and portable medical and fitness applications. The devices contain an ARM Cortex-M4 processor with FPU, execute up to 120MHz and include an ADC, 3MB Flash, 1MB SRAM, external memory interfaces and a versatile set of on-chip peripherals.
         </description>
         <book name="https://datasheets.maximintegrated.com/en/ds/MAX32650.pdf" title="MAX32650 Datasheet"/>
         <book name="Documents/MAX32650_User_Guide.pdf" title="MAX32650 User Guide"/>
         <book name="http://infocenter.arm.com/help/topic/com.arm.doc.dui0553a/DUI0553A_cortex_m4_dgug.pdf" title="Cortex-M4 Generic User Guide"/>
         <feature type="Timer" n="6" m="32" name="32-Bit Timers"/>
         <feature type="DMA" n="6"/>
         <feature type="IOs" n="106"/>
         <feature type="WDT" n="2"/>
         <feature type="RTC" n="32768"/>
         <feature type="ADC" n="10" m="10" name="Sigma-Delta ADC, 7.8ksps, Two 5.5V tolerant inputs, Two 1.2V tolerant inputs"/>
         <feature type="TimerOther" n="16" name="Channel Pulse Train Engine"/>
         <feature type="SDIO" n="1" m="4" name="SD Host Controller (SDHC)"/>
         <feature type="SPI" n="3" m="60000000" name="3 SPI Masters"/>
         <feature type="SPI" n="1" m="30000000" name="1 SPI Slave"/>
         <feature type="I2S" n="1"/>
         <feature type="ExtBus" n="4" name="SPI-XiP RAM for external data/code memory expansion"/>
         <feature type="ExtBus" n="8" name="Hyper Bus and AccelaBus for external data/code memory expansion"/>
         <feature type="ExtBus" n="4" name="SPI-XIP Flash for external code memory expansion"/>
         <feature type="I2C" n="2" name="3 I2C Masters"/>
         <feature type="I2C" n="1" name="1 I2C Slave"/>
         <feature type="UART" n="3" m="4000000"/>
         <feature type="USBD" n="1" name="Hi Speed USB Device"/>
         <feature type="VCC" n="1.08" m="1.32" name="Core Supply Voltage"/>
         <feature type="VCC" n="1.8" m="3.6" name="1.8V - 3.6V VDD with I/O Supply Selectable Between 1.8V and 3.6V"/>
         <feature type="Temp" n="-40" m="85"/>
         <feature type="PowerMode" n="4" name="LP3 Run, LP2 DMA, LP1 Standby, LP0 Stop"/>
         <feature type="CoreOther" n="1" name="CRC Calculation Unit"/>
         <feature type="ClockOther" n="120000000" name="High Frequency Internal Relaxation Oscillator"/>
         <feature type="ClockOther" n="40000000" name="Low Power 40MHz Internal Ring Oscillator"/>
         <feature type="ClockOther" n="7372800" name="7.3728MHz Internal Ring Oscillator"/>

         <device Dname="MAX32650">
            <debugconfig default="swd" clock="1000000"/>
            <compile header="Libraries/Device/Maxim/MAX32650/Include/max32650.h" define="MAX32650"/>
            <memory id="IROM1" start="0x10000000" size="0x00300000" startup="1" default="1"/>
            <memory id="IRAM1" access="rwx" start="0x20000000" size="0x00100000" init="0" default="1"/>
            <algorithm name="Flash/MAX32650.FLM" start="0x10000000" size="0x00300000" default="1" style="Keil" />
            <algorithm  name="FlashIAR/FlashMAX32650.flash" start="0x10000000" size="0x00300000" RAMstart="0x20000000" RAMsize="0x00100000" default="0" style="IAR"/>
            <debug svd="SVD/MAX32650/max32650.svd"/>
         </device>
         <device Dname="MAX32651">
            <debugconfig default="swd" clock="1000000"/>
            <compile header="Libraries/Device/Maxim/MAX32650/Include/max32650.h" define="MAX32650"/>
            <memory id="IROM1" start="0x10000000" size="0x00300000" startup="1" default="1"/>
            <memory id="IRAM1" access="rwx" start="0x20000000" size="0x00100000" init="0" default="1"/>
            <algorithm name="Flash/MAX32650.FLM" start="0x10000000" size="0x00300000" default="1" style="Keil" />
            <algorithm  name="FlashIAR/FlashMAX32650.flash" start="0x10000000" size="0x00300000" RAMstart="0x20000000" RAMsize="0x00100000" default="0" style="IAR"/>
            <debug svd="SVD/MAX32650/max32650.svd"/>
         </device>
         <device Dname="MAX32652">
            <debugconfig default="swd" clock="1000000"/>
            <compile header="Libraries/Device/Maxim/MAX32650/Include/max32650.h" define="MAX32650"/>
            <memory id="IROM1" start="0x10000000" size="0x00300000" startup="1" default="1"/>
            <memory id="IRAM1" access="rwx" start="0x20000000" size="0x00100000" init="0" default="1"/>
            <algorithm name="Flash/MAX32650.FLM" start="0x10000000" size="0x00300000" default="1" style="Keil" />
            <algorithm  name="FlashIAR/FlashMAX32650.flash" start="0x10000000" size="0x00300000" RAMstart="0x20000000" RAMsize="0x00100000" default="0" style="IAR"/>
            <debug svd="SVD/MAX32650/max32650.svd"/>
         </device>
      </family>
   </devices>

   <!-- MAX32650 Evaluation Kit Board Support Package -->
   <boards>
      <board vendor="Maxim" name="MAX32650_EVKIT" revision="REV 3.0" salesContact="sales@maximintegrated.com" orderForm="http://www.maximintegrated.com/MAX32650">
         <description>The MAX32650 Evaluation Kit provides a convenient platform for evaluating the capabilities of the MAX32650 Family of microcontrollers. The Evaluation Kit also provides a complete, functional system ideal for developing and debugging applications. This Evaluation Kit supports both the MAX32650 and the MAX32651 (Trust Protection Unit (TPU) enabled).
         </description>
         <image small="http://www.mxim.net/microcontroller/pack/images/MAX32650_EvKit_Small.jpg" large="http://www.mxim.net/microcontroller/pack/images/MAX32650_EvKit_Large.jpg"/>
         <book category="manual" name="https://datasheets.maximintegrated.com/en/ds/MAX32650EVKIT.pdf" title="MAX32650 Evaluation Kit Datasheet"/>
         <book category="schematic" name="https://datasheets.maximintegrated.com/en/ds/MAX32650EVKIT.pdf" title="MAX32650 Evaluation Kit Datasheet"/>
         <mountedDevice Dvendor="Maxim:23" Dname="MAX32650"/>
         <compatibleDevice Dvendor="Maxim:23" Dfamily="MAX3265X"/>
         <feature type="PWR" n="3.3" m="5.5"/>
         <feature type="Proto" n="13" m="11" name="13 x 11 Prototyping Area with one row connected to 1.8V PWR, one row connected to 3.3V PWR and one row connected to GND"/>
         <feature type="Memory" n="16" name="MB SPI Flash"/>
         <feature type="DIO" n="49" name="General Purpose IO on 3 x 16 pin headers, JH1-JH3, and 1 pin on JH4"/>
         <feature type="AIO" n="4" name="Analog Inputs on 4 x 2 pin headers"/>
         <feature type="SPI" n="4" name="3 x SPI Master and 1 x SPI Slave ports mapped on GPIO"/>
         <feature type="I2C" n="3" name="Up to 3 x I2C Master Ports,  1 x I2C Slave (shares same I/O as each of the master ports)"/>
         <feature type="RS232" n="4" name="1 UART, either UART0 or UART1, can be connected to the USB Micro B connector (CN1) via jumpers (JP10, JP12, JP13 and JP14). RTS/CTS hardware flow control are supported via USB as well. The remaining 3 UARTS are mapped to GPIO headers."/>
         <feature type="LED" n="4" name="User LEDs"/>
         <feature type="Other" n="1" name="External Bluetooth 4.0 Low Energy transceiver with chip antenna"/>
         <feature type="GLCD" n="1" m="128.32" name="pixel graphic OLED display module. User connectable to SPI0 via jumpers"/>
         <feature type="XTAL" n="120000000"/>
         <debugInterface adapter="JTAG/SW" connector="20-pin ARM Standard JTAG Connector (0.1 inch connector)"/>
         <debugInterface adapter="JTAG/SW" connector="10-pin Cortex Debug Connector (0.05 inch connector)"/>
      </board>

      <board vendor="Maxim" name="MAX32651_EVKIT" revision="REV 3.0" salesContact="sales@maximintegrated.com" orderForm="http://www.maximintegrated.com/MAX32650">
         <description>The MAX32651 Evaluation Kit provides a convenient platform for evaluating the capabilities of the MAX32651 microcontroller. The Evaluation Kit also provides a complete, functional system ideal for developing and debugging applications. This Evaluation Kit supports the MAX32651 which includes the Trust Protection Unit (TPU).
         </description>
         <image small="http://www.mxim.net/microcontroller/pack/images/MAX32650_EvKit_Small.jpg" large="http://www.mxim.net/microcontroller/pack/images/MAX32650_EvKit_Large.jpg"/>
         <book category="manual" name="https://datasheets.maximintegrated.com/en/ds/MAX32650EVKIT.pdf" title="MAX32650 Evaluation Kit Datasheet"/>
         <book category="schematic" name="https://datasheets.maximintegrated.com/en/ds/MAX32650EVKIT.pdf" title="MAX32650 Evaluation Kit Datasheet"/>
         <mountedDevice Dvendor="Maxim:23" Dname="MAX32651"/>
         <feature type="PWR" n="3.3" m="5.5"/>
         <feature type="Proto" n="13" m="11" name="13 x 11 Prototyping Area with one row connected to 1.8V PWR, one row connected to 3.3V PWR and one row connected to GND"/>
         <feature type="Memory" n="16" name="MB SPI Flash"/>
         <feature type="DIO" n="49" name="General Purpose IO on 3 x 16 pin headers, JH1-JH3, and 1 pin on JH4"/>
         <feature type="AIO" n="4" name="Analog Inputs on 4 x 2 pin headers"/>
         <feature type="SPI" n="4" name="3 x SPI Master and 1 x SPI Slave ports mapped on GPIO"/>
         <feature type="I2C" n="3" name="Up to 3 x I2C Master Ports,  1 x I2C Slave (shares same I/O as each of the master ports)"/>
         <feature type="RS232" n="4" name="1 UART, either UART0 or UART1, can be connected to the USB Micro B connector (CN1) via jumpers (JP10, JP12, JP13 and JP14). RTS/CTS hardware flow control are supported via USB as well. The remaining 3 UARTS are mapped to GPIO headers."/>
         <feature type="LED" n="4" name="User LEDs"/>
         <feature type="Other" n="1" name="External Bluetooth 4.0 Low Energy transceiver with chip antenna"/>
         <feature type="GLCD" n="1" m="128.32" name="pixel graphic OLED display module. User connectable to SPI0 via jumpers"/>
         <feature type="XTAL" n="120000000"/>
         <debugInterface adapter="JTAG/SW" connector="20-pin ARM Standard JTAG Connector (0.1 inch connector)"/>
         <debugInterface adapter="JTAG/SW" connector="10-pin Cortex Debug Connector (0.05 inch connector)"/>
      </board>
   </boards>
   <!-- Evaluation Kit Example Programs -->
   <examples>

      <example name="ADC" doc="ARM/Abstract.txt" folder="Boards/Maxim/MAX32650_EVKIT/ADC">
         <description>ADC Demo</description>
         <board name="MAX32650_EVKIT" vendor="Maxim"/>
         <project>
            <environment name="uv" load="ARM/ADC.uvprojx"/>
            <environment name="iar" load="IAR/ADC.ewp" />
         </project>
         <attributes>
            <category>Example Project</category>
            <category>MAX32650 Evaluation Kit</category>
            <component Cclass="CMSIS" Cgroup="CORE"/>
            <component Cclass="Device" Cgroup="Startup"/>
            <component Cclass="Device" Cgroup="PeriphDriver" Csub="ADC"/>
            <component Cclass="Device" Cgroup="PeriphDriver" Csub="Timers"/>
            <component Cclass="Device" Cgroup="PeriphDriver" Csub="SPI"/>
            <component Cclass="Device" Cgroup="PeriphDriver" Csub="I2C"/>
            <component Cclass="Device" Cgroup="PeriphDriver" Csub="UART"/>
            <component Cclass="Device" Cgroup="PeriphDriver" Csub="RTC" />
            <component Cbundle="MAX32650 KIT BSP" Cclass="BSP" Cgroup="Board Support"/>
            <keyword>Getting Started</keyword>
            <keyword>Display</keyword>
         </attributes>
      </example>

