glcloud/keil_v5/ARM/PACK/.Web/Maxim.MAX32650.pdsc
      <example name="USB_CDCACM" doc="ARM/Abstract.txt" folder="Boards/Maxim/MAX32650_EVKIT/USB_CDCACM">
         <description>USB CDC ACM Device Class Demo</description>
         <board name="MAX32650_EVKIT" vendor="Maxim"/>
         <project>
            <environment name="uv" load="ARM/USB_CDCACM.uvprojx"/>
            <environment name="iar" load="IAR/USB_CDCACM.ewp" />
         </project>
         <attributes>
            <category>Example Project</category>
            <category>MAX32650 Evaluation Kit</category>
            <component Cclass="CMSIS" Cgroup="CORE"/>
            <component Cclass="Device" Cgroup="Startup"/>
            <component Cclass="Device" Cgroup="PeriphDriver" Csub="Timers"/>
            <component Cclass="Device" Cgroup="PeriphDriver" Csub="RTC"/>
            <component Cclass="Device" Cgroup="PeriphDriver" Csub="SPI"/>
            <component Cclass="Device" Cgroup="PeriphDriver" Csub="I2C"/>
            <component Cclass="Device" Cgroup="PeriphDriver" Csub="UART"/>
            <component Cclass="Device" Cgroup="PeriphDriver" Csub="XiP Flash"/>
            <component Cbundle="MAX32650 KIT BSP" Cclass="BSP" Cgroup="Board Support"/>
            <component Cbundle="MAXUSB_HS" Cclass="MAXUSB_HS" Cgroup="MAXUSB_HS"/>
            <keyword>USB</keyword>
            <keyword>CDC</keyword>
            <keyword>ACM</keyword>
         </attributes>
      </example>

      <example name="USB_HIDKeyBoard" doc="ARM/Abstract.txt" folder="Boards/Maxim/MAX32650_EVKIT/USB_HIDKeyBoard">
         <description>USB HID Keyboard Device Class Demo</description>
         <board name="MAX32650_EVKIT" vendor="Maxim"/>
         <project>
            <environment name="uv" load="ARM/USB_HIDKeyBoard.uvprojx"/>
            <environment name="iar" load="IAR/USB_HIDKeyBoard.ewp" />
         </project>
         <attributes>
            <category>Example Project</category>
            <category>MAX32650 Evaluation Kit</category>
            <component Cclass="CMSIS" Cgroup="CORE"/>
            <component Cclass="Device" Cgroup="Startup"/>
            <component Cclass="Device" Cgroup="PeriphDriver" Csub="Timers"/>
            <component Cclass="Device" Cgroup="PeriphDriver" Csub="RTC"/>
            <component Cclass="Device" Cgroup="PeriphDriver" Csub="SPI"/>
            <component Cclass="Device" Cgroup="PeriphDriver" Csub="I2C"/>
            <component Cclass="Device" Cgroup="PeriphDriver" Csub="UART"/>
            <component Cclass="Device" Cgroup="PeriphDriver" Csub="XiP Flash"/>
            <component Cbundle="MAX32650 KIT BSP" Cclass="BSP" Cgroup="Board Support"/>
            <component Cbundle="MAXUSB_HS" Cclass="MAXUSB_HS" Cgroup="MAXUSB_HS"/>
            <keyword>USB</keyword>
            <keyword>HID</keyword>
            <keyword>Keyboard</keyword>
         </attributes>
      </example>

      <example name="USB_MassStorage" doc="ARM/Abstract.txt" folder="Boards/Maxim/MAX32650_EVKIT/USB_MassStorage">
         <description>USB Mass Storage Demo</description>
         <board name="MAX32650_EVKIT" vendor="Maxim"/>
         <project>
            <environment name="uv" load="ARM/USB_MassStorage.uvprojx"/>
            <environment name="iar" load="IAR/USB_MassStorage.ewp" />
         </project>
         <attributes>
            <category>Example Project</category>
            <category>MAX32650 Evaluation Kit</category>
            <component Cclass="CMSIS" Cgroup="CORE"/>
            <component Cclass="Device" Cgroup="Startup"/>
            <component Cclass="Device" Cgroup="PeriphDriver" Csub="Timers"/>
            <component Cclass="Device" Cgroup="PeriphDriver" Csub="RTC"/>
            <component Cclass="Device" Cgroup="PeriphDriver" Csub="SPI"/>
            <component Cclass="Device" Cgroup="PeriphDriver" Csub="I2C"/>
            <component Cclass="Device" Cgroup="PeriphDriver" Csub="UART"/>
            <component Cclass="Device" Cgroup="PeriphDriver" Csub="XiP Flash"/>
            <component Cbundle="MAX32650 KIT BSP" Cclass="BSP" Cgroup="Board Support"/>
            <component Cbundle="MAXUSB_HS" Cclass="MAXUSB_HS" Cgroup="MAXUSB_HS"/>
            <keyword>USB</keyword>
            <keyword>HID</keyword>
            <keyword>Keyboard</keyword>
         </attributes>
      </example>

      <example name="Watchdog" doc="ARM/Abstract.txt" folder="Boards/Maxim/MAX32650_EVKIT/Watchdog">
         <description>Watchdog Timer Demo</description>
         <board name="MAX32650_EVKIT" vendor="Maxim"/>
         <project>
            <environment name="uv" load="ARM/Watchdog.uvprojx"/>
            <environment name="iar" load="IAR/Watchdog.ewp" />
         </project>
         <attributes>
            <category>Example Project</category>
            <category>MAX32650 Evaluation Kit</category>
            <component Cclass="CMSIS" Cgroup="CORE"/>
            <component Cclass="Device" Cgroup="Startup"/>
            <component Cclass="Device" Cgroup="PeriphDriver" Csub="Watchdog"/>
            <component Cclass="Device" Cgroup="PeriphDriver" Csub="Timers"/>
            <component Cclass="Device" Cgroup="PeriphDriver" Csub="RTC"/>
            <component Cclass="Device" Cgroup="PeriphDriver" Csub="SPI"/>
            <component Cclass="Device" Cgroup="PeriphDriver" Csub="I2C"/>
            <component Cclass="Device" Cgroup="PeriphDriver" Csub="UART"/>
            <component Cbundle="MAX32650 KIT BSP" Cclass="BSP" Cgroup="Board Support"/>
            <keyword>Getting Started</keyword>
         </attributes>
      </example>

   </examples>

   <conditions>
      <!-- MAX32650 Device Condition -->
      <condition id="MAX32650 Device">
         <description> Maxim Integrated MAX32650 device family</description>
         <require Dvendor="Maxim:23"/>
         <require Dname="MAX32650"/>
      </condition>

      <!-- MAX32651 Device Condition -->
      <condition id="MAX32651 Device">
         <description> Maxim Integrated MAX32651 device</description>
         <require Dvendor="Maxim:23"/>
         <require Dname="MAX32651"/>
      </condition>

      <!-- MAX32651 Device Condition -->
      <condition id="MAX32652 Device">
         <description> Maxim Integrated MAX32652 device</description>
         <require Dvendor="Maxim:23"/>
         <require Dname="MAX32652"/>
      </condition>

      <!-- MAX32650/51/52 CMSIS-CORE Condition - This accepts any of the three device conditions -->
      <condition id="MAX32650 CMSIS-CORE">
         <description>Maxim MAX32650 Series devices and CMSIS-CORE</description>
         <require Cclass="CMSIS" Cgroup="CORE"/>
         <accept condition="MAX32650 Device"/>
         <accept condition="MAX32651 Device"/>
         <accept condition="MAX32652 Device"/>
         <require Cclass="Device" Cgroup="Startup"/>
      </condition>

      <condition id="MAX32651 CMSIS-CORE">
         <description>Maxim MAX32650 Series devices and CMSIS-CORE</description>
         <require Cclass="CMSIS" Cgroup="CORE"/>
         <require condition="MAX32651 Device"/>
         <require Cclass="Device" Cgroup="Startup"/>
      </condition>

      <!-- Keil/ARM Compiler Condition -->
      <condition id="Startup ARM">
         <description>Startup files for the Keil/ARMCC Toolchains</description>
         <require Tcompiler="ARMCC"/>
      </condition>

      <!-- GNUC/Eclipse Compiler Condition -->
      <condition id="Startup GCC">
         <description>Startup files for the GNU C Toolchain</description>
         <require Tcompiler="GCC"/>
      </condition>

      <!-- IAR Embedded Workbench Compiler Condition -->
      <condition id="Startup IAR">
         <description>Startup files for the IAR Embedded Workbench Toolchain</description>
         <require Tcompiler="IAR"/>
      </condition>

      <!-- ADC Peripheral Condition -->
      <condition id="MAX32650 CMSIS ADC">
         <description>ADC Interface</description>
         <require condition="MAX32650 CMSIS-CORE"/>
      </condition>

