glcloud/keil_v5/ARM/PACK/.Web/Maxim.MAX32650.pdsc
      <!-- MAX32652 Device Selection -->
      <component Cclass="Device" Cgroup="Startup" Cversion="1.1.0-a" condition="MAX32652 Device">
         <description>System Startup for Maxim MAX32652 Microcontroller</description>
         <RTE_Components_h>
               <!-- the following content goes into file 'RTE_Components.h' -->
               #define TARGET MAX32650   /* Target Device Part Number */
               #define TARGET_REV 0x4131 /* Target Device Revision Number */
               #define TARGET_NUM 32650 /* Just the number of the target part */
         </RTE_Components_h>
         <files>
            <!-- Include paths for the tools -->
            <file category="include" name="Libraries/Device/Maxim/MAX32650/Include/" version="1.1.0-a" />
            <file category="include" name="Libraries/MAX32650PeriphDriver/Include/" version="1.1.0-a" />

            <!-- Keil/ARM device startup file and sub_main to call SystemInit -->
            <file category="sourceAsm" attr="config" version="1.1.0-a" name="Libraries/Device/Maxim/MAX32650/Source/ARM/startup_max32650.s" condition="Startup ARM" />
            <!-- <file category="sourceAsm" attr="config" version="1.1.0-a" name="Libraries/Device/Maxim/MAX32650/Source/ARM/sub_main.c" condition="Startup ARM" /> -->

            <!-- GNUC/Eclipse device startup file -->
            <file category="sourceAsm" attr="config"  version="1.1.0-a" name="Libraries/Device/Maxim/MAX32650/Source/GCC/startup_max32650.S" condition="Startup GCC" />

            <!-- IAR device startup file, low level init and cmain.s -->
            <file category="sourceAsm" attr="config" name="Libraries/Device/Maxim/MAX32650/Source/IAR/startup_max32650.s" condition="Startup IAR" version="1.1.0-a" />
            <file category="sourceC" attr="config"  version="1.1.0-a" name="Libraries/Device/Maxim/MAX32650/Source/IAR/low_level_init.c" condition="Startup IAR" />
            <file category="sourceAsm" attr="config"  version="1.1.0-a" name="Libraries/Device/Maxim/MAX32650/Source/IAR/cmain.s" condition="Startup IAR" />

            <!-- System, NVIC and device header files common to all platforms -->
            <file category="sourceC" attr="config"  version="1.1.0-a" name="Libraries/Device/Maxim/MAX32650/Source/system_max32650.c" />
            <file category="sourceC" name="Libraries/MAX32650PeriphDriver/Source/nvic_table.c" version="1.1.0-a" />
            <file category="header" attr="config" name="Libraries/Device/Maxim/MAX32650/Include/max32650.h" version="1.1.0-a"  />
            <file category="sourceC" name="Libraries/MAX32650PeriphDriver/Source/gpio.c"  version="1.1.0-a" />
            <file category="sourceC" name="Libraries/MAX32650PeriphDriver/Source/icc.c"  version="1.1.0-a" />
            <file category="sourceC" name="Libraries/MAX32650PeriphDriver/Source/lp.c"  version="1.1.0-a" />
            <file category="sourceC" name="Libraries/MAX32650PeriphDriver/Source/mxc_assert.c"  version="1.1.0-a" />
            <file category="sourceC" name="Libraries/MAX32650PeriphDriver/Source/mxc_delay.c"  version="1.1.0-a" />
            <file category="sourceC" name="Libraries/MAX32650PeriphDriver/Source/mxc_lock.c"  version="1.1.0-a" />
            <file category="sourceC" name="Libraries/MAX32650PeriphDriver/Source/mxc_pins.c"  version="1.1.0-a" />
            <file category="sourceC" name="Libraries/MAX32650PeriphDriver/Source/mxc_sys.c"  version="1.1.0-a" />
            <file category="sourceC" name="Libraries/MAX32650PeriphDriver/Source/rtc.c"  version="1.1.0-a" />
            <file category="sourceC" name="Libraries/MAX32650PeriphDriver/Source/nvic_table.c"  version="1.1.0-a" />
            <file category="sourceC" name="Libraries/MAX32650PeriphDriver/Source/sema.c"  version="1.1.0-a" />
         </files>
      </component>

      <component Cclass="Device" Cgroup="PeriphDriver" Csub="ADC" Cversion="1.1.0-a" condition="MAX32650 CMSIS ADC"> <description>ADC Interface</description>
         <files>
            <file category="sourceC" name="Libraries/MAX32650PeriphDriver/Source/adc.c" version="1.1.0-a"/>
         </files>
      </component>

      <component Cclass="Device" Cgroup="PeriphDriver" Csub="AES" Cversion="1.1.0-a" condition="MAX32651 CMSIS AES" >
         <description>AES Interface</description>
         <files>
            <file category="sourceC" name="Libraries/MAX32650PeriphDriver/Source/crypto.c" version="1.1.0-a"/>
            <file category="sourceC" name="Libraries/MAX32650PeriphDriver/Source/maa.c" version="1.1.0-a"/>
            <file category="sourceC" name="Libraries/MAX32650PeriphDriver/Source/mem_utils.c" version="1.1.0-a"/>
         </files>
      </component>

      <component Cclass="Device" Cgroup="PeriphDriver" Csub="CLCD" condition="MAX32650 CMSIS CLCD" Cversion="1.1.0-a">
         <description>CLCD-TFT Controller</description>
         <files>
            <file category="sourceC" name="Libraries/MAX32650PeriphDriver/Source/clcd.c" version="1.1.0-a"/>
         </files>
      </component>

      <component Cclass="Device" Cgroup="PeriphDriver" Csub="DMA" condition="MAX32650 CMSIS DMA" Cversion="1.1.0-a">
         <description>Standard DMA</description>
         <files>
            <file category="sourceC" name="Libraries/MAX32650PeriphDriver/Source/dma.c" version="1.1.0-a"/>
         </files>
      </component>

      <component Cclass="Device" Cgroup="PeriphDriver" Csub="EMCC" condition="MAX32650 CMSIS EMCC" Cversion="1.1.0-a">
         <description>External Memory Cache Controller (EMCC)</description>
         <files>
            <file category="sourceC" name="Libraries/MAX32650PeriphDriver/Source/emcc.c" version="1.1.0-a"/>
         </files>
      </component>

      <component Cclass="Device" Cgroup="PeriphDriver" Csub="HyperBus" condition="MAX32650 CMSIS HYPER" Cversion="1.1.0-a">
         <description>HyperBus/Xcella Bus Interface</description>
         <files>
            <file category="sourceC" name="Libraries/MAX32650PeriphDriver/Source/hpb.c" version="1.1.0-a"/>
            <file category="sourceC" name="Libraries/MAX32650PeriphDriver/Source/emcc.c" version="1.1.0-a"/>
         </files>
      </component>

      <component Cclass="Device" Cgroup="PeriphDriver" Csub="Flash IAP" condition="MAX32650 CMSIS IAP" Cversion="1.1.0-a">
         <description>In-Application Programming for Internal Flash Memory</description>
         <files>
            <file category="sourceC" name="Libraries/MAX32650PeriphDriver/Source/flc.c" version="1.1.0-a"/>
         </files>
      </component>

      <component Cclass="Device" Cgroup="PeriphDriver" Csub="I2C" condition="MAX32650 CMSIS I2C" Cversion="1.1.0-a">
         <description>I2C Interface</description>
         <files>
            <file category="sourceC" name="Libraries/MAX32650PeriphDriver/Source/i2c.c" version="1.1.0-a"/>
         </files>
      </component>

      <component Cclass="Device" Cgroup="PeriphDriver" Csub="I2S" condition="MAX32650 CMSIS I2S" Cversion="1.1.0-a">
         <description>I2S Interface</description>
         <files>
            <file category="sourceC" name="Libraries/MAX32650PeriphDriver/Source/i2s.c" version="1.1.0-a"/>
         </files>
      </component>

      <component Cclass="Device" Cgroup="PeriphDriver" Csub="1-Wire" condition="MAX32650 CMSIS OWM" Cversion="1.1.0-a">
         <description>1-Wire Interface</description>
         <files>
            <file category="sourceC" name="Libraries/MAX32650PeriphDriver/Source/owm.c" version="1.1.0-a"/>
         </files>
      </component>

